Tekla.Structures.Model.TransformationPlane
The TransformationPlane class describes a transformation from global model coordinates
to local and back to global.
The following example shows how to use transformation planes for transforming points:
using Tekla.Structures.Model;
using Tekla.Structures.Geometry3d;
public class Example
{
public void Example1()
{
Model myModel = new Model();
WorkPlaneHandler myWorkPlaneHandler = myModel.GetWorkPlaneHandler();
Beam myBeam = new Beam();
Point Point1 = new Point();
Point Point2 = new Point();
TransformationPlane currentPlane = myWorkPlaneHandler.GetCurrentTransformationPlane();
TransformationPlane beamPlane = new TransformationPlane(myBeam.GetCoordinateSystem());
Point lPoint1 = beamPlane.TransformationMatrixToLocal.Transform(currentPlane.TransformationMatrixToGlobal.Transform(Point1));
Point lPoint2 = beamPlane.TransformationMatrixToLocal.Transform(currentPlane.TransformationMatrixToGlobal.Transform(Point2));
}
}